---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ZoneElementDomainData
source: html/4fd427fa-088d-0fd9-4046-2f8f82f8b1e2.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneElementDomainData

A base class for specific domain requirements for a zone.

## Syntax (C#)
```csharp
public class ZoneElementDomainData : IDisposable
```